In [5]:
import pandas as pd

In [6]:
# reading from a csv file
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
df = pd.read_csv('example.csv')

In [14]:
# writing to a csv file
df.to_csv('My_output', index=False) # not adding a extra column for indexes

In [15]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [16]:
# Reading and Writing from an excel file
# pandas thinks that an excel file is a bunch of sheets
# and each sheet is a DataFrame

In [18]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [20]:
df = pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

In [22]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet') # writing

In [33]:
df_new = pd.read_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

In [34]:
df_new

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [23]:
# Reading a HTML file

In [24]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
# returns list of tables

ValueError: No tables found

In [25]:
data[0]

NameError: name 'data' is not defined

In [26]:
# Reading from a sql database
# pandas is not widely used to read sql tables

In [27]:
from sqlalchemy import create_engine

In [28]:
engine = create_engine('sqlite:///:memory:') # creating a temporary engine in the memory

In [29]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [30]:
df.to_sql('my_table', engine) # table_name, engine_name

In [31]:
sqldf = pd.read_sql('my_table', con=engine)

In [32]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15